{
  "totalVideos": 471,
  "withTranscripts": 445,
  "top10": [
    {
      "id": "3510310242065220743",
      "url": "https://www.instagram.com/p/DC3IJEVtoSH/",
      "commentsCount": 5783,
      "caption": "Buckle up because this is an absolutely WILD response to getting politicians banned from stock trading",
      "hook": "For a ban on congress members trading stocks? Yeah. I mean, this is, like, number 1,000 on my priority list of things to care about. This is one of th",
      "fullTranscript": "For a ban on congress members trading stocks? Yeah. I mean, this is, like, number 1,000 on my priority list of things to care about. This is one of those stupid things that I've been dragged through the mud on. You know how many how much fucking money I've ever had in the stock market? About $20,000. I've been dragged through the mud on this as if like there's some insider trading. This is one of those bills that like some of course yeah. People support it. Yeah. Sure. Okay. Who cares? Because I don't have any I barely have anything in the market anyway. Are there a couple cases like in wherein Nancy Pelosi has some very suspicious timing of her trades? Yeah. That that has happened. I but nobody else can point any other examples out. So sure. Yeah. Why not? Don't let us trade stocks. How about we'll just keep whipping ourselves. How about we don't make any money either? How about like, just cut our paychecks? We haven't gotten a pay raise since 02/2008, even a COLA increase. Yeah, no, actually no, yeah, this is a great idea. Let's make Congress a place where only the millionaires can actually afford to do the job. This is a wonderful idea. Let's just keep doing that. Then it's always some member, right? Who senses the populist energy and mirrors it. Believing that this is what's gonna help me connect with the people because what do the people want? Well, mean, they want an easy button. All my problems will be solved if there's no stock trading.",
      "transcriptLength": 1468
    },
    {
      "id": "3734016164616103902",
      "url": "https://www.instagram.com/p/DPR4-sFgmfe/",
      "commentsCount": 3966,
      "caption": "Ford CEO Jim Farley says, \"We don't have the mechanics\" to fill every bay in their dealerships.",
      "hook": "This morning when I woke up, there were 6,000 bays in our dealerships with no tech so can't get my car fixed. Nope. Two weeks. Average wait is two wee",
      "fullTranscript": "This morning when I woke up, there were 6,000 bays in our dealerships with no tech so can't get my car fixed. Nope. Two weeks. Average wait is two weeks. Not because we don't have the parts. We don't have the mechanics. Factory workers, construction workers, farmers, all the people that move things, truck drivers, rail workers, and people fix things, plumbers, electricians, HVAC, all the people that basically work with their hands. Why is there a shortage of these workers? Well, it's a complicated problem, but there is. Let's put it that way. Literally a million openings right now. Technicians and dealerships working on cars. At Ford, we have 6,000, probably 400,000 repair technician shortages across the economy. First of all, the productivity has not caught up with with the white collar. In fact, it's gone down over the last twenty years. Number two, the jobs aren't as glamorous as a white collar job from college. And I think the permitting and and all the regulations has really stunted the growth of these kind of jobs.",
      "transcriptLength": 1036
    },
    {
      "id": "3707149608534175717",
      "url": "https://www.instagram.com/p/DNycO156G_l/",
      "commentsCount": 3854,
      "caption": "President Trump claims that China has to give the US magnets or face a 200% tariff:",
      "hook": "They have to give us magnets. If they don't give us magnets, then then we have to charge them 200% tariff or something, you know. China intelligently ",
      "fullTranscript": "They have to give us magnets. If they don't give us magnets, then then we have to charge them 200% tariff or something, you know. China intelligently went and they sort of took a monopoly of the world's magnets.",
      "transcriptLength": 211
    },
    {
      "id": "3715266751769738887",
      "url": "https://www.instagram.com/p/DOPR20pDf6H/",
      "commentsCount": 3752,
      "caption": "Trump says he's going to speak to the EU after it fined Google $3.5 billion: \"I can just say, 'You can't do that.'\"",
      "hook": "No. I'm gonna be speaking to the European Union, but it's not fair. Google just got fined 3 and a half billion dollars, and they've already paid 13,00",
      "fullTranscript": "No. I'm gonna be speaking to the European Union, but it's not fair. Google just got fined 3 and a half billion dollars, and they've already paid 13,000,000,000. They're up to 16 and a half billion dollars, and people say there was nothing wrong with what they did. It's almost a source of income to run Europe. It's become a source of income, and many other companies too. Mostly tech companies, but we can't let that happen. No. I can just say you can't do that. I mean, you know, they respect us now. I don't hear that about China, and I don't hear that about other places. I hear it about the European Union. We were talking about it last night. I think that was the highest IQ group of people I think any room has ever had last night. That was about as high as you can have. All the tech geniuses were there. They they love their computers. Yeah. It did, it did come up. A couple of companies said that they were taxed by the European Union.",
      "transcriptLength": 945
    },
    {
      "id": "3565961765802484715",
      "url": "https://www.instagram.com/p/DF811UtSCPr/",
      "commentsCount": 3209,
      "caption": "New game: guess who he’s referring to 👀",
      "hook": "Could you mention some of the things that your team has found, some of the crazy numbers, including the woman that walked away with about 30,000,000 R",
      "fullTranscript": "Could you mention some of the things that your team has found, some of the crazy numbers, including the woman that walked away with about 30,000,000 Right. Etcetera? Well, we we we often we do find it sort of rather odd that, you know, there there are quite a few people in in the bureaucracy who who have a ostensibly a salary of a few $100,000, but somehow managed to accrue tens of millions of dollars in net worth while they are in that position, which is, you know, what what happened to USAID. We're just curious as to where it came from. Maybe they're very good at investing. They in which case, we should take their investment advice, perhaps. But just this seems to be mysteriously they they get wealthy. We don't know why. Where do they come from? And I think the reality is that they're getting wealthier to taxpayer expense. That's that's the that's the honest truth of it.",
      "transcriptLength": 885
    },
    {
      "id": "3546480939300622808",
      "url": "https://www.instagram.com/p/DE3oZ_NtRHY/",
      "commentsCount": 2942,
      "caption": "Breaking: Biden in his farewell speech went out swinging\n\n✅ A ban on congressional stock trading\n✅ A ban on Dark Money donations\n✅ 18 year term limits for the Supreme Court\n\nLet’s ride.",
      "hook": "We need to get dark money. That's that hidden funding behind too many campaigns contributions. We need to get it out of our politics. We need to enact",
      "fullTranscript": "We need to get dark money. That's that hidden funding behind too many campaigns contributions. We need to get it out of our politics. We need to enact an eighteen year time limit, term limit, time and term for the strongest ethics and the strongest ethics reforms for our supreme court. We need to ban members of congress from from trading stock while they're in the congress. We need to amend the constitution to make clear that no president no president is immune from crimes that he or she commits while in office.",
      "transcriptLength": 517
    },
    {
      "id": "3533919486761820405",
      "url": "https://www.instagram.com/p/DELAQy5ROD1/",
      "commentsCount": 2666,
      "caption": "FOLLOW THE MONEY 💰 \n-\n-\n-\n#quiverquant #quiverquantitative #stocks #stockmarket #stockstobuy #stockinvesting #invest #investing #stocktrading #trading #daytrading #daytrade #swingtrade #howtoinvest #makemoney #learnstocks",
      "hook": "How is it possible that all these members of congress are worth millions of dollars on a salary of just 174,000? I'll give you a hint. It's not speaki",
      "fullTranscript": "How is it possible that all these members of congress are worth millions of dollars on a salary of just 174,000? I'll give you a hint. It's not speaking fees. They do it by trading stocks. Let me give you an example. Back in November, I noticed that congresswoman Debbie Wasserman bought shares at a company called Viasat. For those who don't know, Viasat is a satellite internet provider who also happens to do a ton of business with the US military. Now, the reason this stood out to me at the time is because Debbie Wasserman isn't just your average congresswoman. She just so happens to sit on the house subcommittee on military construction. What this means is that she sits on closed door meetings learning about all sorts of new military contract discussions that are completely closed off to the public. The fact she bought shares in ViaSat, a major defense contractor, while attending these meetings told me that maybe she knows something about ViaSat that we don't. And sure enough, fast forward just one month later, NASA announced a 4,820,000,000.00 contract for low Earth orbit satellites in which one of the companies awarded was, yep, you guessed it, ViaSat. And since I made that post about Debbie buying ViaSat in November, shares are up more than 40%. Now I wish I could say that this was an isolated incident, but the truth is this happens all the time. And it's the reason that until they outlaw trading in congress, you should be tracking what they're buying and selling. Because maybe they know something that we don't. To track congress trades and government contracts, check out Quiver Quan where I track it all live.",
      "transcriptLength": 1641
    },
    {
      "id": "3617108221610334889",
      "url": "https://www.instagram.com/p/DIyjMNnOpqp/",
      "commentsCount": 2428,
      "caption": "Hey ABC, I think we need a part 2. 🤯\n\nAbsolutely crazy to think that they finally starting to talk about a ban going through. \n\nIf our app Autopilot can help, we’ll keep pushing it! \n\nPart 2 will be uploaded later this week.\n-\n-\nInvestment advice provided by Autopilot advisers LLC, an SEC registered investment advisor. Past performance does not guarantee future results. Investing carries risks including the risk of the loss of principal. Performance doesn’t include fees. See more here.",
      "hook": "What the Like, how are they allowed to do it when other Americans can't? Sunny Santa Monica, California, seemingly a world away from Washington DC, is",
      "fullTranscript": "What the Like, how are they allowed to do it when other Americans can't? Sunny Santa Monica, California, seemingly a world away from Washington DC, is where we found Chris Joseph's and his different morning routine. Every day, Chris wakes up, makes a cup of coffee, and then alongside fellow Internet sleuths sifts through the stock trades members of congress make. It all started off as infuriating because it's you're like, what the Like, how are they allowed to do it when other Americans can't? As long as a trade is reported before forty five days, there's no law preventing members of the house or senate from trading stocks. Outraged at first, Chris then saw an opportunity to get in on the action. He moved out west and with three friends launched the app autopilot. It lets users follow a politician's trades and then copy them, automatically buying or selling the same stock a lawmaker does at whatever dollar amount they like. That's where the money is? Yeah. The reason why we initially set out with the politicians is because they were killing They were killing it. They were killing it. Yeah. They were making a lot of money. You're trying to get in on the money? I'm trying to get in on the money. Yep.",
      "transcriptLength": 1217
    },
    {
      "id": "3023116247391863568",
      "url": "https://www.instagram.com/p/Cn0RDW4gQMQ/",
      "commentsCount": 2238,
      "caption": "Martha Stewart though? JAIL 🤷‍♂️\n-\n-\n-\n#quiverquant #quiverquantitative #stocks #stockmarket #stockstobuy #stockinvesting #invest #investing #stocktrading #trading #daytrading #daytrade #swingtrade #howtoinvest #makemoney #learnstocks",
      "hook": "Follow me down the rabbit hole of how I figured out a senator thinks he's above the law, and there's nothing you or I can do about it. I got a tip the",
      "fullTranscript": "Follow me down the rabbit hole of how I figured out a senator thinks he's above the law, and there's nothing you or I can do about it. I got a tip the other day telling me I should look into a bill in congress right now called s forty ninety. This caught my eye because what the bill effectively wants to do is add regulations to the sale of vitamins and supplements, which would essentially make it illegal to sell any that don't comply with a costly approval process. And if cheap, over the counter vitamins are outlawed, it's easy to see how pharmaceutical companies would stand to benefit. The reason I'm telling you this is that the main sponsor of the bill is senator Richard Durbin from Illinois. And, of course, the first question in my head when I read the bill was, has he bought any pharmaceutical stocks recently? Because if he did, it would be a clear conflict of interest. Right? But after a good thirty minutes of looking, I couldn't find a single stock transaction that he's reported. Now this is weird because the law clearly states that if you're in congress, you have to disclose any financial transactions above $1,000 within forty five days. Eventually, I figured out that Richard Durbin, who, mind you, has been a senator for ten years now, has yet to file a periodic stock trade disclosure once. And it's not like he's not trading. Files annual financial reports, and in them, I can see him moving hundreds of thousands of dollars around. But as far as posting them regularly, like the law says, he has never done it once. I've tried reaching out to his office and the people who work for him, but haven't received a single reply. So if you take away anything from what I said, it's this. We don't know if Richard Durbin is gonna benefit if he gets the bill passed financially, but we should have the right to know. And the fact that he's blatantly disregarded financial laws for over ten years and nothing has happened should concern every American. Follow for more, and thanks for watching.",
      "transcriptLength": 2015
    },
    {
      "id": "3534875500049896018",
      "url": "https://www.instagram.com/p/DEOZonptJJS/",
      "commentsCount": 2231,
      "caption": "Look where others don’t ✍️\n-\n-\n-\n#quiverquant #quiverquantitative #stocks #stockmarket #stockstobuy #stockinvesting #invest #investing #stocktrading #trading #daytrading #daytrade #swingtrade #howtoinvest #makemoney #learnstocks",
      "hook": "No. This is not true at all. This is like a complete Republican fabrication. It is December 20 '24. Members of Congress have to file financial disclos",
      "fullTranscript": "No. This is not true at all. This is like a complete Republican fabrication. It is December 20 '24. Members of Congress have to file financial disclosures. And you can see from my legal disclosures, that I remain one of the lowest net worth members of congress. To AOC's credit, what she's saying is true. Out of almost 500 congress members, she's six from the bottom when ranked by net worth and hasn't traded single stock since being in office. The reason I can say that is because I'm willing to bet I know the net worth of members of congress better than most of them know themselves. That's because once a year, US politicians have to disclose every single asset that they have that's worth more than $1,000. This made me curious, so what I did was take it a step further, and wrote code that tracks the value of their assets and updates it live daily. The results look like this. The live net worth of hundreds of politicians and how much they made or lost on any given day. And hear me out, I didn't do this because I'm trying to be nosy. I did it because now I can go back and look at this list, see who's performing well at any point in time, and then click on their profile and see if they have any investments that I might want to copy. For instance, right now I can see that Thomas Swazi has made $82,000 in the stock market today. And when I click on his profile, I can see how his investments have done over time, see the composition of his portfolio, and see if there's any stocks holding that stand out to me. I made it public, no counter paywall required, because at the end of the day, the more eyes on this stuff, the better. So if you want to check it out, just look up Congress Live Net Worth Tracker on Google, and it's the first result. Good luck, and until next time.",
      "transcriptLength": 1791
    }
  ],
  "topWords": [
    [
      "that",
      105
    ],
    [
      "this",
      57
    ],
    [
      "they",
      51
    ],
    [
      "have",
      38
    ],
    [
      "stock",
      33
    ],
    [
      "because",
      28
    ],
    [
      "just",
      28
    ],
    [
      "congress",
      26
    ],
    [
      "about",
      25
    ],
    [
      "members",
      24
    ],
    [
      "dont",
      24
    ],
    [
      "like",
      23
    ],
    [
      "were",
      23
    ],
    [
      "what",
      22
    ],
    [
      "know",
      19
    ],
    [
      "people",
      19
    ],
    [
      "from",
      18
    ],
    [
      "which",
      17
    ],
    [
      "trading",
      16
    ],
    [
      "with",
      16
    ],
    [
      "there",
      14
    ],
    [
      "when",
      14
    ],
    [
      "thats",
      14
    ],
    [
      "than",
      14
    ],
    [
      "yeah",
      13
    ],
    [
      "last",
      13
    ],
    [
      "more",
      13
    ],
    [
      "then",
      12
    ],
    [
      "stocks",
      11
    ],
    [
      "trades",
      11
    ]
  ]
}