{
  "analysis_summary": {
    "total_videos_analyzed": 30,
    "pattern_frequency": {
      "personal_story": 19,
      "statistics_mentioned": 10,
      "call_to_action": 20,
      "urgency_language": 24,
      "social_proof": 8,
      "question_hook": 1,
      "polarizing_statement": 11,
      "relatable_scenario": 22,
      "emotional_appeal": 11,
      "contrarian_view": 14
    },
    "pattern_percentage": {
      "personal_story": 63.33333333333333,
      "statistics_mentioned": 33.33333333333333,
      "call_to_action": 66.66666666666666,
      "urgency_language": 80.0,
      "social_proof": 26.666666666666668,
      "question_hook": 3.3333333333333335,
      "polarizing_statement": 36.666666666666664,
      "relatable_scenario": 73.33333333333333,
      "emotional_appeal": 36.666666666666664,
      "contrarian_view": 46.666666666666664
    }
  },
  "top_viral_videos": [
    {
      "rank": 1,
      "author": "nobudgetbabe",
      "url": "https://www.tiktok.com/@nobudgetbabe/video/7056817295368146181",
      "likes": 145900,
      "plays": 784100,
      "shares": 2262,
      "comments": 643,
      "engagement_rate": 0.18977808952939676,
      "duration": 63,
      "description": "Reply to @holistichomejourney no shame, no blame. Money gets to be easy 💯 💸",
      "hashtags": [
        ""
      ],
      "full_transcript": "okay so if you blew all of your money in your twenties on boo shoes and food but now you're ready to get your financial shit together videos for you I am going to share four tangible to dos with you to help you go from broke to ballin for contacts I am a top financial coach who went from 40 000 in debt making 50 000 a year to a millionnaire at 30 years old okay so the first thing that I want you to do is start building out your emergency fund because life is always going to throw unexpected shit at us so we get ahead by learning how to expect the unexpected side cam we are going to start working to increase our credit score because even though it might not seem important to you when we make large purchases like a house or a car and we finance those purchases we will pay thousands to tens of thousands of dollars more simply because we have lower credit don't throw your money away 3rd we are going to put a plan in place to repay our debt using the avalanche method are you gonna do is line up all of your debts from highest to lowest interest rate and pay it off in that order 4th you are going to learn how to invest if you only ever trade your time for money there will always be a limit to how much you can make when you learn how to invest and get your money working for you it's limitless now pro tip none of this is going to work if you don't first address your money mindset and behaviour because everything we do is rooted in psychology in your 20s maybe you knew what you were supposed to do knew you should be saving more you knew you should be paying off your debt but maybe you weren't and this is why psychology is at the forefront of everything that I teach if you wanna learn more hit that plus and cheque her lincolin boo to get started",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 5
    },
    {
      "rank": 2,
      "author": "miarosemcgrath",
      "url": "https://www.tiktok.com/@miarosemcgrath/video/7522006685305589014",
      "likes": 28900,
      "plays": 163500,
      "shares": 653,
      "comments": 133,
      "engagement_rate": 0.181565749235474,
      "duration": 11,
      "description": "jealousy = you don’t think it’s possible for you too",
      "hashtags": [],
      "full_transcript": "how you react to other people's success is a direct reflection of your own self belief if you look at someone doing well and you think “why not me” instead of “that could be me” that's your insecurities talking who said that",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": false,
        "call_to_action": false,
        "urgency_language": false,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 2
    },
    {
      "rank": 3,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7101686676946308394",
      "likes": 229800,
      "plays": 1300000,
      "shares": 1602,
      "comments": 725,
      "engagement_rate": 0.17855923076923078,
      "duration": 43,
      "description": "I did this and my credit score dropped 70 points overnight. 🤦🏻‍♀️ #money #creditscore #creditcard #personalfinance #rich #cash #debt #credit #greenscreen",
      "hashtags": [
        "money",
        "creditscore",
        "creditcard",
        "personalfinance",
        "rich",
        "cash",
        "debt",
        "credit",
        "greenscreen"
      ],
      "full_transcript": "Out with the old and in with the new stop stop what are you doing  cutting my old credit card don't worry i'm gonna call the bank right after and cancel it i got this old thing back in college but now that i'm making some real money i got a better credit card with more rewards do not i repeat do not close your old credit card uh why i don't need it that card is your oldest line of credit if you close it your credit history will shorten and that'll likely hurt your credit score wait really? yes i'm vivian your rich bff i'm a 28 year old millionaire and i even worked as a trader on wall street but nobody gave me this advice when i was 23 if you wanna learn about getting rich and avoiding the money mistakes i made hit me with a follow!",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": false
      },
      "pattern_count": 5
    },
    {
      "rank": 4,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7126272202135211310",
      "likes": 2500000,
      "plays": 14400000,
      "shares": 54800,
      "comments": 10000,
      "engagement_rate": 0.1781111111111111,
      "duration": 58,
      "description": "Replying to @josetolentino79  are you the lucky winner from Illinois?! #money #lottery #winner #chicago #lotto #casino #finance #rich #luxury #billionaire #millionaire",
      "hashtags": [
        "",
        "money",
        "lottery",
        "winner",
        "chicago",
        "lotto",
        "casino",
        "finance",
        "rich",
        "luxury",
        "billionaire",
        "millionaire"
      ],
      "full_transcript": "no have you seen what happens to lottery winners I'm vivian your rich bff and you follow me for good money advice here's what you should do if you actually happen to win the lottery one tell no one people change up when this amount of money is involved then you're gonna take digital and photo copies of the front and back of your ticket you're not gonna sign it you wanna stay anonymous you're gonna put your ticket somewhere very safe idly a safety deposit box at the bank and then you're gonna reach out to an attorney specializing in lottery winnings you're gonna work with them to see how long before you have to claim and if you can claim anonymously if you can't you're gonna wanna delete all your social media and change your phone number and then you're gonna reach out to an accountant you're gonna have a big tax bill this is gonna be important decide now how much money you're giving away to friends and family rule of thumb for this amount is about 20 you're also gonna open a trust so that money is used wisely and not pissed away and last you're gonna take your winnings and invest at least 50 in a diversified portfolio of low response and index tracking ets it's not about getting rich and showing off it's about staying rich",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 4
    },
    {
      "rank": 5,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7025299831191014702",
      "likes": 273200,
      "plays": 1600000,
      "shares": 2296,
      "comments": 7636,
      "engagement_rate": 0.1769575,
      "duration": 49,
      "description": "Reply to @oggangsta15 call an 🚑 but not for me. #money #baddie #finance #women",
      "hashtags": [
        "",
        "money",
        "baddie",
        "finance",
        "women"
      ],
      "full_transcript": "Ooh - I know you didn't think I was gonna let that go.  Please. Buckle up cause it's about to be a bumpy ride.  I may not be some old white guy in a suit but I am an ex-Wall street trader, surprise! what are your credentials? commenting on Read it from your parent’s basement? The typa guy who buys high, sells low  always seems to be on the dump part of a pump & dump.  Maybe we get a debit card, and a credit score above 600 before we start doling out advice yeah?  Like on a plane you put on the mask and then you help others.  And as for me, all those other financial brands you think I should leave finance to, they are obsessed with me because I'm young, rich, successful, and legit.  So let's get one thing crystal clear.  I don't think I'm smart, I am smart and if ya bank account is still attached to ya mom’s lower ya voice when speaking to me. ",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": false,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": false,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 3
    },
    {
      "rank": 6,
      "author": "nobudgetbabe",
      "url": "https://www.tiktok.com/@nobudgetbabe/video/7204492233024736517",
      "likes": 2000000,
      "plays": 12000000,
      "shares": 105800,
      "comments": 4845,
      "engagement_rate": 0.17588708333333333,
      "duration": 51,
      "description": "People who grew up rich won't tell you this, but I had to fight my say here so I'm spilling all the tea. 🍵\n\nIf you invest $75 a week starting at 20 years old for 10 years, just 10 years out of your entire life, you could be financially free before 65.\n\nMeaning you would no longer have to work for money.\n\nBut how does that work because you would have only put away $39,000.\n\nBecause you invested it and compound interest took over, the money grew - to almost $65,000 in 10 years.\n\nAnd then over the next few decades it continued to grow, until it got to over $1.8M at 65.\n\nAny extra dollar you invested would just get you to financial freedom sooner.\n\nLink in bio to start learning with our freebie: Investing Masterclass. ",
      "hashtags": [],
      "full_transcript": "start learning for free link in bio every extra dollar you saved would have just got me to financial freedom sooner and that $64,000 grew into over 1.8 million dollars that $39,000 turn into $64,000 made you rich did its freaking thing compound interest came in took over but because you started early enough okay and we all know that that's not enough to make you financially free because I would have only actually saved $39,000 how is that possible yeah okay Nicole and maybe you're thinking like in the sense that you would never have to work for money again is enough to make you financially free like literally just 10 years out of your entire life from the time you are 20 years old until you're 30 for 10 years so did you know that if you start investing $75 a week so I'm gonna spill all the tea but I had to fight my way here people who grew up rich won't tell you this",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": true,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 7
    },
    {
      "rank": 7,
      "author": "keziamw",
      "url": "https://www.tiktok.com/@keziamw/video/7545852714442411295",
      "likes": 434,
      "plays": 3200,
      "shares": 115,
      "comments": 9,
      "engagement_rate": 0.174375,
      "duration": 85,
      "description": "how to invest in #ai! you dont need to be rich, you just have to be savvy! here's the playbook!",
      "hashtags": [
        "ai"
      ],
      "full_transcript": "Listen Wall Street just dropped $13 billion honey while you was worried about the president's hand and the rich got richer but you if you got $20 here's the they don't want you to know number one, if Petropik is a hundred billion dollar train you can't buy baby cause it's a private company buy the picks in the shuffle Nvidia the chip king AMD the chip challenger Taiwan Semi makes chips for everyone so chips are important why am I eating pretzels? Hips are the engines that make every AI model run honey they turn raw data into intelligence okay, no salt and vinegar anyway Amazon and AWS Microsoft and Azure these are the AI railroads honey no tracks no movement 3 think Equinix and digital reality this is where the AI big dogs rent server space 5 follow the power oh Lord Brad because AI eats electricity Next Era Energy and Duke Energy so here's what you're gonna do you're gonna dollar cost average every Friday across two or three of these stocks or VGT which is a tech fund in fact if that was big money and I had $100 today I'd split it $40 in video $30 Microsoft $30 VGT that covers chips, clouds and diversification hold on let me pick that up in the 1800s people couldn't buy Carnegie Steel but they still invested in railroad and coal mine stocks so why he became a billionaire A whole bunch of other people became millionaires. That's history. That's the Gilded Age. We teach you how to invest in AI at school at night.",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": true,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 5
    },
    {
      "rank": 8,
      "author": "keziamw",
      "url": "https://www.tiktok.com/@keziamw/video/7545852714442411295",
      "likes": 434,
      "plays": 3200,
      "shares": 115,
      "comments": 9,
      "engagement_rate": 0.174375,
      "duration": 85,
      "description": "how to invest in #ai! you dont need to be rich, you just have to be savvy! here's the playbook!",
      "hashtags": [
        "ai"
      ],
      "full_transcript": "Listen Wall Street just dropped $13 billion honey while you was worried about the president's hand and the rich got richer but you if you got $20 here's the they don't want you to know number one, if Petropik is a hundred billion dollar train you can't buy baby cause it's a private company buy the picks in the shuffle Nvidia the chip king AMD the chip challenger Taiwan Semi makes chips for everyone so chips are important why am I eating pretzels? Hips are the engines that make every AI model run honey they turn raw data into intelligence okay, no salt and vinegar anyway Amazon and AWS Microsoft and Azure these are the AI railroads honey no tracks no movement 3 think Equinix and digital reality this is where the AI big dogs rent server space 5 follow the power oh Lord Brad because AI eats electricity Next Era Energy and Duke Energy so here's what you're gonna do you're gonna dollar cost average every Friday across two or three of these stocks or VGT which is a tech fund in fact if that was big money and I had $100 today I'd split it $40 in video $30 Microsoft $30 VGT that covers chips, clouds and diversification hold on let me pick that up in the 1800s people couldn't buy Carnegie Steel but they still invested in railroad and coal mine stocks so why he became a billionaire A whole bunch of other people became millionaires. That's history. That's the Gilded Age. We teach you how to invest in AI at school at night.",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": true,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 5
    },
    {
      "rank": 9,
      "author": "miarosemcgrath",
      "url": "https://www.tiktok.com/@miarosemcgrath/video/7555773343559961878",
      "likes": 18600,
      "plays": 112700,
      "shares": 728,
      "comments": 235,
      "engagement_rate": 0.17358473824312334,
      "duration": 102,
      "description": "Why I don’t want a rich man or a soft life 🎀 #personalfinance #financialfreedom #hypergamy ",
      "hashtags": [
        "personalfinance",
        "financialfreedom",
        "hypergamy"
      ],
      "full_transcript": "there is no bigger flex than a woman that has her own finances sorted. a couple years ago, I kind of got sucked into that whole world of hypergamy creators like Sarah 7, who I think is very entertaining, but that's what she is, an entertainer. this kind of rhetoric of chasing a soft life is very attractive. at the end of the day, that's all we want. freedom to kind of go to Pilates, get a matcha and have a nice time. we all want that. something that I learnt very early on in life is nothing is free. when you're financially dependent on someone, they have a say in what you do. it's like when your parents pay for your wedding, they then get a say on how it goes. and I do believe as women, we offer so much emotional labour, domestic labour, all of these different things. therefore we should be dating people that bring value to our lives. there's no doubt about that. feel like as I entered my mid twenties, but 2 I became the most financially literate I had been. and as my income doubled in the last year, I kind of realised what it felt like to have my own money. of course I already had an income, but actually make enough money where I felt financially free. that was a different feeling. almost feel like this chasing of a soft life or thinking that you're gonna get it through. a man often comes because you feel a lack of financially. if you had your finances savings in order, you probably wouldn't feel that way. if you're still in this mindset that someone else is going to do it for you, prepare for a life where you get assigned values and tasks. you trade one boss for another. I get it. the world of finance investing can seem overwhelming and like it's not meant for us. honestly, the internet has democratized this information. I urge you to take a few hours to just learn about the basics. stocks and shares, ices, emergency funds. these are all things that we should be knowing about as women. yes, it's fine to want a rich man, but I think we can also be rich women ourselves.",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": true
      },
      "pattern_count": 6
    },
    {
      "rank": 10,
      "author": "nobudgetbabe",
      "url": "https://www.tiktok.com/@nobudgetbabe/video/7454597080103849222",
      "likes": 833300,
      "plays": 5400000,
      "shares": 49200,
      "comments": 40000,
      "engagement_rate": 0.17083333333333334,
      "duration": 262,
      "description": "How to Get Rich in 2025—No Gatekeeping\n\nWhat if I told you that getting rich doesn’t have to be complicated? In this video, I’m sharing insights and strategies that helped me go from $40,000 in debt to self-made millionaire by 30.\n\nThese are the same concepts I teach in my 3-month coaching program, The Makin Money Moves Method. It’s designed to help you shift your money mindset, take control of your finances, and build wealth—without giving up the things you love.\n\nAs a published author and featured expert in CBC, Fox, Business Insider, and The Financial Times, I’ve helped thousands of students transform their finances.\n\n💡 Start with my free trainings to gain quick wins and momentum toward your goals. Or if you’re ready to change your life in 2025 and looking for more support, apply to work with me as your seven-figure mentor.\n\n📲 Visit my website to get started: nobudgetbabe.com ",
      "hashtags": [],
      "full_transcript": "everyone believes that getting rich is complicated okay but that is because when they hear how the real rich actually do things they go oh no that's too simple to be true so instead they waste their time and their money on a bunch of bullshit and then they end up in my DMS asking for help because they are worse off than when they started you need to stop it okay you are better than that you do what I'm telling you I promise you you will have more wealth that you have ever had before first thing I'm gonna need you to do is interact with this video not because it's good for me even though it is thank you but because you are showing the algorithm what you want to see more of because if you're serious about getting rich the first thing that you need to do is you need to start changing what you consume cause every time you watch a video about the newest must have makeup the boot of the season these apps they're gonna file your profile away as a consumer someone to keep advertising to so they can keep lining their pockets with cash even if you have the best intentions if you are always being sold a problem that you don't actually have you are never going to build your mind needs to be on how to grow your money not spend it on things you don't need the simplest way to build wealth is quite literally not spending all of your money so let's start there you are going to unsubscribe from promo emails know you don't need to know about Aritzia's new sale because let's get real you're not saving money then you are just spending it I want you to unfollow people who make you feel like what you have is not good enough that you are not pretty enough that you are not popular enough as you are because that that is just feeding an unhealthy addiction that again is making them rich and not you you think that by making this next purchase it's finally gonna turn you into the person that you've always wanted to be but it's a trap if you follow what they say you will never be enough because being enough is not profitable learning to love yourself the way that you are that is the best way save money next thing you're gonna do is stop trying to get ahead by cutting all the little joys out of your life you like that five dollar coffee does it bring you joy I need you to know that no one ever got rich by not buying a five dollar coffee they did get rich by investing into companies that sell the coffee so you've been tricked into the idea that the only way to get ahead is to be unhappy that's just a lie fed to you by the people who benefit from you staying where you are if everyone realized that you could build wealth and still enjoy your life how would they exploit us once you have changed your mindset about what is possible for you and you have removed the temptation of self sabotage then it is time to start seeing money for what it actually is okay nothing more than a physical representation of hours of your life because the way that most people play it is they work they trade hours of their life or money but that my friends is not what the rich do they don't necessarily work for their money they get the money and then they put that money to work for them they turn that money into a worker that never quits they don't do this by following their passions their passions because that's another bullshit lie do what you love and the money will come for most people no it won't your life is not your job your job is not your identity your job is simply a means for you to make money so you can live your life but again for most people they're gonna get that wrong so they stay stuck the rich buy apartment buildings and businesses and parking lots not because they love bricks or asphalt but because they love the freedom the safety and security that comes with being rich money problems they will make things a thousand times worse but having money it makes those problems basically disappear they become nothing more than a small inconvenience and if you think you need to be rich to do those things no you don't you can buy an apartment building right now for $1 if you wanted to can become a part owner in literally thousands of companies for $5 if you wanted to start today do this by putting your money into something called like a real estate investment trust okay a reat that is where you are pulling your money with other investors and you are buying these buildings you are profiting off of them the monthly rents without ever having a lifted finger you can buy index funds at ETF to start getting paid like a business owner without the headache there's obviously only so much that I can put into a oh my god we're already at 4 minutes four minute video okay it took me a decade to learn these things but essentially this is the exact methodology and process I used to go from $40,000 in debt to becoming a millionaire at 30 years old the easiest way to get rich isn't complicated it's Manila it's all about learning how to effectively save your money without giving up the things that you love so you don't feel restricted and end up binge spending and then priority",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": true
      },
      "pattern_count": 8
    },
    {
      "rank": 11,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7192282718527425835",
      "likes": 283900,
      "plays": 1800000,
      "shares": 20300,
      "comments": 3126,
      "engagement_rate": 0.17073666666666668,
      "duration": 58,
      "description": "#stitch with @legzeii how long have you worked at your current company?? #money #career #job #work #linkedin #pay #corporate #interview #resume #salary #boss #employee #office #greenscreen #finance #pension #401k #rothira ",
      "hashtags": [
        "stitch",
        "",
        "money",
        "career",
        "job",
        "work",
        "linkedin",
        "pay",
        "corporate",
        "interview",
        "resume",
        "salary",
        "boss",
        "employee",
        "office",
        "greenscreen",
        "finance",
        "pension",
        "401k",
        "rothira"
      ],
      "full_transcript": "cause that money was guaranteed to the employee how do we prepare for retirement I'm Vivian you're rich BFF and your favorite all street girly they had something called a pension whereas with a pension the employer was on the hook and if you want more career and money advice follow me invest that money for them we gotta contribute our own money it is sort of not for big salary bumps but for big pension contributions essentially employers would set aside money for these employees employers started adopting them and saying your retirement's your problem so we gotta make more our grandparents and parents were loyal sound familiar to your 401k? and then these employees would be guaranteed payouts in retirement but as soon as 401ks were launched in 1978 but a 401k is shittier in every way the more your company was obligated to give to you and if you wanna make more you can't really afford to stay anywhere for longer than 2 years because they had a reason to and if you don't do this too bad so sad you're setting your money aside you're picking investments and the longer your worked somewhere our parents and grandparents would work at one company for 30 years",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": false,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 2
    },
    {
      "rank": 12,
      "author": "nastyaswan",
      "url": "https://www.tiktok.com/@nastyaswan/video/7514413608978091294",
      "likes": 112700,
      "plays": 735400,
      "shares": 11100,
      "comments": 301,
      "engagement_rate": 0.16875305955942344,
      "duration": 13,
      "description": "night delivery",
      "hashtags": [],
      "full_transcript": "Guys, I just came home, and this is what's laying next to my door. I mean, what the hell",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": false,
        "urgency_language": false,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": false,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 1
    },
    {
      "rank": 13,
      "author": "nobudgetbabe",
      "url": "https://www.tiktok.com/@nobudgetbabe/video/7239371891100765445",
      "likes": 1100000,
      "plays": 7200000,
      "shares": 57800,
      "comments": 3896,
      "engagement_rate": 0.16134666666666667,
      "duration": 101,
      "description": "If you want to get rich in your 20s, then you need to learn from the rich people.\n\nI went from $40k debt to a millionaire at 30, and now I'm spilling all my secrets so you can get here too.\n\nThe first thing rich people don't do is work to pay for the things they want, like the houses, cars and travel.\n\nI just went on the most expensive vacation I've ever taken, and I didn't pay for a dollar of it out of my pocket.\n\nInstead, I focused on buying assets like stocks and real estate that pay me while I sleep, and now that cash flow funds my lifestyle.\n\nAnd this is not just \"for the rich\", you could buy into an apartment building for $1 by purchasing a REIT. This is one of the strategies I use, and I make 6 figures a year without working.\n\nThe second thing rich people don't do is spend time with people who don't have the life they want.\n\nIf you were trying to get sober, what do you think would happen if all your friends were heavy drinkers and spent every weekend in the bar? \n\nWhen I started hanging out with people who were making 6 figures a month, wealth became demystified. I realized when you know how money works, the amount you can make is endless.\n\nThird thing rich people don't do is wait for shit to get bad before taking action.\n\nEver heard the story about how to kill a frog? \n\nPut a frog in boiling water, and he'll jump out right away. Put a frog in luke warm water and slowly bring it to a boil, the frog won't notice and he'll cook to death.\n\nSo many of us are in situations we say \"aren't that bad\", we're living paycheck to paycheck, we're in crappy jobs that don't pay our worth, we don't have money to pay our debts or buy the things we want.\n\nSociety has us in a warm water chokehold, and many people won't realize what that really means until it's too late.\n\nStart learning how to win with money with our FREE trainings. Find them on our website under FREEBIES ❤️ ",
      "hashtags": [],
      "full_transcript": "if you wanna get rich in your 20s then you need to learn from rich people if you don't know any rich people don't worry I've gotcha I went from broke $40,000 in debt living paycheck to paycheck to becoming a self made millionaire at the age of thirty now I teach others how it's done first thing that rich people don't do is they don't work for the things that they own they don't work for their house they don't work to pay for their travel they don't work to pay for their car like I just got back from the most expensive vacation I've ever taken and I didn't pay for a dollar of it out of my own pocket instead I focused on buying assets like stocks and real estate that pay me while I sleep and now that cash flow funds my lifestyle which means I don't have to work for money because what good is a Rolex if it only tells you when your lunch break is over you need to understand that investing is not just for the rich it's how you get rich you could quite literally buy an apartment building for $1 if you wanted to do this by buying something called a reach a real estate investment trust it's a company that owns and operates real estate and then shares their profits with you this is one of the strategies I use to make over six figures a year without working second thing rich people don't do is spend time with people that don't have the life that they do want if you were trying to get sober and all of your friends were heavy drinkers and spent every weekend in the bar what do you think would happen when I started hanging out with people who are making six figures a month wealth became like demystified for me I realized when you know how money works the amount that you can make is endless the third thing rich people don't do is wait for shit to get bad before taking action put a frog in boiling water and he'll jump out right away put a frog in lukewarm water and slowly bring it to a boil frog won't notice and he'll cook to death so many of us are in situations that we say aren't that bad we say we're living paycheck to paycheck and we're struggling but it's not that bad say we can't pay off our debts but it's not that bad we say we don't have money to do the things that we want in life but it's not that bad society has us in a warm water chokehold and many people won't realize what that actually means until it's too late learn how to start winning with money with our free trainings grab your spot on our website under freebies",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": true
      },
      "pattern_count": 6
    },
    {
      "rank": 14,
      "author": "chrisjjosephs",
      "url": "https://www.tiktok.com/@chrisjjosephs/video/7390074237261761808",
      "likes": 20900,
      "plays": 152100,
      "shares": 2126,
      "comments": 1323,
      "engagement_rate": 0.16008547008547008,
      "duration": 57,
      "description": "Just in: Looks like the Senators are making moves\n\nFor the first time ever, a group of Senators have announced a deal to ban congress members from trading stocks\n\nThe legislation is scheduled to be discussed on July 24th",
      "hashtags": [],
      "full_transcript": "Truth is Congress should not be here to make a buck. Congress should be here to serve the American people. There is no reason why members of Congress ought to be profiting off of the information that only they get that the rest of the American people don't get. And I don't care even if you don't have so called insider information or information not available to the public, why should members of Congress be spending their time day trading rather than focusing on the priorities that the American people sent us here to achieve and focus on? I mean, it's really simple and you don't have to explain it to anybody in America. The only people you have to explain it to are here in this building. The only people who don't seem to understand why stock trading should be banned are here in the capital. Every American gets it and they're right to get it. There is no reason why the personal profit of members of Congress should come first. It should come last. It shouldn't be a consideration at all. And I'm proud to say I think this Bill takes a giant step forward to getting to that place. I think it's a tough Bill. I think it's a serious Bill.",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": false,
        "call_to_action": false,
        "urgency_language": false,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": false
      },
      "pattern_count": 2
    },
    {
      "rank": 15,
      "author": "quiverquant",
      "url": "https://www.tiktok.com/@quiverquant/video/7194932247735127339",
      "likes": 629100,
      "plays": 4200000,
      "shares": 35400,
      "comments": 6149,
      "engagement_rate": 0.15967833333333334,
      "duration": 113,
      "description": "WATCHING THIS ONE… 🧐 #quiverquant #geopolitics #stocks #finance #learnontiktok #norway #fyp ",
      "hashtags": [
        "quiverquant",
        "geopolitics",
        "stocks",
        "finance",
        "learnontiktok",
        "norway",
        "fyp"
      ],
      "full_transcript": "people are up in arms after photos broke yesterday showing the terrible conditions of a cobalt mine in the Congo. of course, the irony here is that a lot of cobalt, along with many other materials powering the Green Revolution, are often sourced from places like this with little regard for environmental or labor loss. the reason I'm telling you this is that while all this was going on, a report came out of Norway that went largely ignored by the media, in which they announced they found a substantial amount of rare earth minerals on their seabed. many of which are currently being sourced from places like the cobalt mine and the Congo I mentioned earlier. and here's the catch. they estimated to have found so how much is that? let's do some quick math. the current market rate of cobalt is about 21 ￡1. multiply that by 31 million tons, that cobalt is worth 13 trillion, give or take, or 3 times norway's total GDP. now, of course, if Nor were to extract all that cobalt, it would be worth far less than 13 trillion dollars because they'd flood the market with it. but nevertheless, when you consider all the other materials they found and how much of it, it's difficult to ignore the deep sea mining opportunity laying under the ocean. now, here's where I ran into some issues. there's only a few deep sea mining stocks and none of them have been able to commercialize yet, so they're all bleeding money. I was about to give up, then I came across as CEO of a deep sea mining company with the ticker TMC that has been buying shares of his own company recently. this intrigued me so I started researching them more. and that's when I noticed that tmc's second and if you don't know, the reason that this is such a big deal is because Maersk is the largest container shipping company in the world by tonnage and All Seas is a major offshore construction company. in fact, they both have major share positions in TMC. a company that has almost 0 ceiling as far as economic and environmental benefits. along with the CEO buying shares all while the company is down 90 percent from its IPO. it makes me wonder if there's more than meets the eye with TMC. this might be more of a lottery ticket than an investment, but what do you guys think? in the meantime, to see what stocks politicians, hedge funds, and Ceos are buying, check out Quiverquant. and until next time.",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": true,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 7
    },
    {
      "rank": 16,
      "author": "nobudgetbabe",
      "url": "https://www.tiktok.com/@nobudgetbabe/video/7362944010450750725",
      "likes": 158200,
      "plays": 1200000,
      "shares": 28200,
      "comments": 4715,
      "engagement_rate": 0.1592625,
      "duration": 107,
      "description": "They don't have your money, they don't have any money.\n\nThe US is just 10 years away from a full blown retirement crisis, where the people who have been paying into social security their entire lives might just not get anything, with benefits expected to be cut as early as 2034.\n\nPeople are getting ready to retire, wondering where their money is, and it's not there.\n\nAnd if they had invested that money on their own instead of giving it to the government, they could easily be retiring with millions.\n\nIf instead of paying 6.2% of your pay into Social Security, you put that into the stock market, let's say you were making $60k a year, you'd have over $2.6M. That would provide you with $100,000 a year in income for the rest of your life. You probably could have even retired early.\n\nNow that social security will fully run out of money in 2037, a few options they're considering are raising the retirement age because 65 is too young, or they're considering just scrapping the program altogether.\n\nYou can't depend on anyone to take care of you in this life but yourself, and we've been lied to about what retirement is. It's not an age, it's a number in the bank.",
      "hashtags": [],
      "full_transcript": "this is so incredibly concerning for every single person that lives in the US not only do they not have your money they don't have any money and now the US is just 10 years away from a full blown retirement crisis for people who have been paying into Social Security for their entire lives are going to see their benefits cut starting in 2034 with Social Security expected to fully run out by 2037 like people are getting ready to retire wondering where their money is and it's not there and one of the most horrendous parts of this is that if these people hadn't have given their money to the government for Social Security they could easily be retiring with millions of dollars so with Social Security you contribute about 6.2% of your paycheck into this fund so let's say instead of putting that money into Social Security you put that into the stock market you're paying 6.2% of your paycheck you're making $60,000 a year you could retire with over $2.6 million this $2.6 million could have provided you with over $100,000 a year in income and perpetuity for the rest of your life however long you lived and you honestly probably could have even retired early based on this sum now people are looking at retiring with nothing that they have put into this fund and the proposed solution some of them are to just scrap the program entirely altogether just get rid of it and another proposed solution is to just change the age of retirement because apparently 65 is too young this is why I say you cannot depend on anyone in this life to take care of you you and this is why I also say that we have been lied to okay they want you to think retirement is an age retirement is 65 or now retirement is 70 no retirement is a number in the bank don't just get to retire when you're 65 as we have seen from this you get to retire when you have enough money to cover your expenses if you wanna learn more about how to do this check our link in bio",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": true,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 6
    },
    {
      "rank": 17,
      "author": "nobudgetbabe",
      "url": "https://www.tiktok.com/@nobudgetbabe/video/7089407131555843333",
      "likes": 493500,
      "plays": 3300000,
      "shares": 19500,
      "comments": 2253,
      "engagement_rate": 0.15613727272727274,
      "duration": 60,
      "description": "Reply to @dulcenina11 I teach you about money 💰",
      "hashtags": [
        ""
      ],
      "full_transcript": "okay so a bunch of you guys have been asking what steps did I take to set my sons up to become millionnaires I'm doing this through the power of investing aka where your money makes you more money now I have a few different types of investments set up for them the first one being for their education with the purpose of the second one being just like general investments they can use it to buy a house retire early take a sabbatical or a gap you're like whatever it is that they wanna do my whole goal is to set my kids up for financial success so that they never have to worry about money the way that I did now essentially what I'm doing in this account is I'm putting 200 a month from the time that they're born until they are 20 years old so this will give us roughly 143 000 with 95 000 of that being free money so if I stop contributing at 20 years old and they just leave that 143 000 alone in their investments to grow by the traditional age of retirement they would have over $10.4 million and because that's a crazy amount of money instead of waiting till 65 to retire they could retire at 40520+25 years with over $1.5 million this is without them ever contributing another dollar on their own I'm a millionnaire who teaches you about money follow for more and cheque or lincolin boo",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": true,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": false,
        "emotional_appeal": true,
        "contrarian_view": false
      },
      "pattern_count": 6
    },
    {
      "rank": 18,
      "author": "sierraxliyah",
      "url": "https://www.tiktok.com/@sierraxliyah/video/7512203139659877663",
      "likes": 21300,
      "plays": 144000,
      "shares": 668,
      "comments": 418,
      "engagement_rate": 0.15545833333333334,
      "duration": 89,
      "description": "A lot of people ask what platform I use to actually trade with— and I use Webull  !  This is honestly been the easiest platform for me to use, and if you’ve ever been on any of my live trading zooms , or classes over in my discord group Crystal Academy , you’ll know I’m a Webull girlie! \n\nI like it because it is user-friendly, you can trade options like I do🤭. You can buy shares, and you can even trade futures! All of the features that you would need for basic investment can be found on one singular platform.  \n\nLet me know in the comments if you love Webull too! 💙\n\nDisclaimer: By using any links in this video, I may receive a commission. This comes at no additional cost to you, and it allows me to continue to provide value on this community. I am not a financial advisor. This is not financial advice nor am I recommending any investments. All information in this video is for entertainment purposes only. Sierra Smith (“Affiliate”) is compensated by Webull Financial LLC (“Webull”) member of FINRA and SIPC. Investing involves risk. More info at webull.com/disclosures. Options are risky and not suitable for all investors. Investors can rapidly lose 100% or more of their investment trading option. Before trading options, carefully read Characteristics and Risks of Standardized Options, available at Webull.com/policy.\n ",
      "hashtags": [],
      "full_transcript": "Hey y'all, it's Sierra and if you've ever wanted to start investing or trading options, here's exactly how to do it with weebull. Step 1 you're gonna go to my bio, click the link, and download the weebull app. Step 2 is sign up for a brokerage account. It only takes a couple minutes and it may take a day or two to get approved, but once you get that email, you're in. If you want to trade options like I do, taking single leg calls and puts, make sure you apply for a level 2 account. Step 3 which is the fun part. Get it? Fun funds is fund your account. You can start with as little as $50 $100. I don't know why people think that you need thousands of dollars to start. You don't. Plus I heard you might be able to get some free stocks. You didn't hear it from me though. Now once you're in, here's exactly what I do. I open the app and I head straight to my watch list. This is where I keep all the stocks that I'm tracking for the week. If I'm curious about something new, I just hit the search bar and pull it up. When I'm ready to trade, I just choose my stock and we will shows me all the options contracts available. It's super beginner friendly. Just a few taps and I'm in. One of my favourite tools, the markets tab, because here you can Check futures, trade shares, and even practice with paper trading. So if you're not ready to risk real money yet, don't practice with fake money in real time until you feel confident. So if you're ready to finally start trading, or if you just want to learn, click the link in my bio and give weebull a try. I might be biased, but hey, you might love it just as much as I do.",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": true,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": false
      },
      "pattern_count": 7
    },
    {
      "rank": 19,
      "author": "chrisjjosephs",
      "url": "https://www.tiktok.com/@chrisjjosephs/video/7218362366545726738",
      "likes": 91900,
      "plays": 656900,
      "shares": 7482,
      "comments": 2536,
      "engagement_rate": 0.1551499467194398,
      "duration": 49,
      "description": "Another day another politician making a sketchy trade. As long as they do it, we will continue to expose it 🫡 #fyp #virtal #fintok #stocks #investing #teachme #viral #insiders#greenscreen #greenscreenvideo ",
      "hashtags": [
        "fyp",
        "virtal",
        "fintok",
        "stocks",
        "investing",
        "teachme",
        "viral",
        "insiders",
        "greenscreen",
        "greenscreenvideo"
      ],
      "full_transcript": "which directly oversees the company that he just bought and until they get banned we're gonna continue to let you copy trade them he just disclosed buying $250,000 of the energy giant NGL including his new investment NGL They’re going to be capping oil production through the end of the year Meet Republican Congressman Mark Green since his buy on March 24th he's up almost 30% in just one week this is why we built a way for you to copy trade these politicians OPEC shocked the energy sector by announcing which sent energy stock soaring which comes out to almost $80,000 in profits because they continue to make these big winners all while sitting on committees that directly oversee the companies that they buy And coincidentally just a couple days after he made that investment this may have just happened and if that wasn't enough he also happens to sit on the Natural Resources Committee",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": true,
        "call_to_action": false,
        "urgency_language": false,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": false,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 1
    },
    {
      "rank": 20,
      "author": "calltoleap",
      "url": "https://www.tiktok.com/@calltoleap/video/7280610496284216622",
      "likes": 86700,
      "plays": 690000,
      "shares": 18800,
      "comments": 959,
      "engagement_rate": 0.15428840579710146,
      "duration": 59,
      "description": "Follow @calltoleap for investing videos! How to Make Your Kids Millionaires! Check out my reaction to @theashleymfox video.\n\nFollow me @calltoleap to learn more things like this about money!\n\nBenefits of Custodial Roth IRAs include:\n• Tax-free withdrawals in retirement.\n• Compound interest over many years.\n• Instills good saving habits in minors.\n• Teaches investing and financial responsibility.\n• Minors can contribute if they have earned income.\n• No required minimum distributions during the account holder's lifetime.\n• Allows for a smooth wealth transfer to the minor at adulthood.\n• The account is established for a minor, typically someone under the age of 18 or 21, depending on state laws.\n\n@calltoleap\n\n@calltoleap\n\n@calltoleap\n\nMake sure you check out my next master class on September 26th at 5:30 PM PT the link to sign up is in my bio! 🔥\n\nAre you going to try this? Comment down below!👇\n\n#money #investing #finance #personalfinance",
      "hashtags": [
        "money",
        "investing",
        "finance",
        "personalfinance"
      ],
      "full_transcript": "I went to school for finance, and I worked on Wall Street. And one of the biggest things I Learned on Wall Street is that I got exposed to that information in my 20s. Wishing I got exposed to it when I was a baby. Now I have a niece. She's the next generation. When she was born, the moment she got a Social Security number, I opened a brokerage account for her. Because I remember being on Wall Street and watching them open brokerage accounts the moment their kids were born. I remember looking at college students, the children of the billionaires we serviced. I remember seeing them live off their dividend portfolios. Right? So instead of feeling like I was behind, I felt like the moment my niece was born, I got a head start. When you open an investment account for a child, you need your social. You need their Social Security number. You need your Social Security number. You need their birthday, their address. She's absolutely right. Kids have a lot of time to compound their wealth. Guys, if you invest five to six hundred dollars a month, by the time they're 18 years old, they'll have around a quarter million dollars from average stock market returns. Follow to see my videos where I can show a step by step tutorial on how to set this up.",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": false
      },
      "pattern_count": 5
    },
    {
      "rank": 21,
      "author": "calltoleap",
      "url": "https://www.tiktok.com/@calltoleap/video/7280610496284216622",
      "likes": 86700,
      "plays": 690100,
      "shares": 18800,
      "comments": 959,
      "engagement_rate": 0.15426604839878277,
      "duration": 59,
      "description": "Follow @calltoleap for investing videos! How to Make Your Kids Millionaires! Check out my reaction to @theashleymfox video.\n\nFollow me @calltoleap to learn more things like this about money!\n\nBenefits of Custodial Roth IRAs include:\n• Tax-free withdrawals in retirement.\n• Compound interest over many years.\n• Instills good saving habits in minors.\n• Teaches investing and financial responsibility.\n• Minors can contribute if they have earned income.\n• No required minimum distributions during the account holder's lifetime.\n• Allows for a smooth wealth transfer to the minor at adulthood.\n• The account is established for a minor, typically someone under the age of 18 or 21, depending on state laws.\n\n@calltoleap\n\n@calltoleap\n\n@calltoleap\n\nMake sure you check out my next master class on September 26th at 5:30 PM PT the link to sign up is in my bio! 🔥\n\nAre you going to try this? Comment down below!👇\n\n#money #investing #finance #personalfinance",
      "hashtags": [
        "money",
        "investing",
        "finance",
        "personalfinance"
      ],
      "full_transcript": "I went to school for finance, and I worked on Wall Street. And one of the biggest things I Learned on Wall Street is that I got exposed to that information in my 20s. Wishing I got exposed to it when I was a baby. Now I have a niece. She's the next generation. When she was born, the moment she got a Social Security number, I opened a brokerage account for her. Because I remember being on Wall Street and watching them open brokerage accounts the moment their kids were born. I remember looking at college students, the children of the billionaires we serviced. I remember seeing them live off their dividend portfolios. Right? So instead of feeling like I was behind, I felt like the moment my niece was born, I got a head start. When you open an investment account for a child, you need your social. You need their Social Security number. You need your Social Security number. You need their birthday, their address. She's absolutely right. Kids have a lot of time to compound their wealth. Guys, if you invest five to six hundred dollars a month, by the time they're 18 years old, they'll have around a quarter million dollars from average stock market returns. Follow to see my videos where I can show a step by step tutorial on how to set this up.",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": false
      },
      "pattern_count": 5
    },
    {
      "rank": 22,
      "author": "miarosemcgrath",
      "url": "https://www.tiktok.com/@miarosemcgrath/video/7525669305027955991",
      "likes": 65600,
      "plays": 457600,
      "shares": 1940,
      "comments": 248,
      "engagement_rate": 0.14813811188811188,
      "duration": 77,
      "description": "are you ‘frugal chic’? #savingmoney #personalfinance #splurgevssave ",
      "hashtags": [
        "savingmoney",
        "personalfinance",
        "splurgevssave"
      ],
      "full_transcript": "the frugal Chic who is she on the surface she appears very luxurious but underneath it all she is very savvy about her money so these are five things that characterise the Frugal Chic No. 1 she makes inexpensive items look luxurious her friends are always asking her where is this from and she says it's from vintage Zara and they're shocked she makes it look expensive it's her aura number two she walks absolutely everywhere if she can walk somewhere she will that £1 75 from the bus may not seem like a lot but that's £1 75 that she doesn't wanna spend on tfl No. 3 she has an eclectic personal style that was built over time she realises that she can't buy her way into a subculture or an aesthetic these things are curated and collected over time for example she doesn't need the latest bag charm trend she has one from five years ago from when she went on holiday the key is no one else has it No. 4 even though she loves her iced matchas iced lattes she will not be buying one every single day it's not a need it's a want she'd rather make it at home or have it at work No. 5 the frugal chic is actually not afraid to say no and she knows her values while other people call her grandma she will not be spending £400 on a night out yes she still goes out to bars sees friends at this point she's accepted that she's a little bit of a homebody but that doesn't make her boring she has other hobbies so those are five things that characterise the frugal chic do you think this sounds like you let me know in the comments below",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": false,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 5
    },
    {
      "rank": 23,
      "author": "quiverquant",
      "url": "https://www.tiktok.com/@quiverquant/video/7395328848730148142",
      "likes": 106600,
      "plays": 789400,
      "shares": 7642,
      "comments": 2561,
      "engagement_rate": 0.14796427666582215,
      "duration": 60,
      "description": "Congress is a rich man’s club\n\n-\n-\n-\n\n#quiverquant #quiverquantitative #stocks #stockmarket #investing #stocktrading #trading #daytrading #congress #politics",
      "hashtags": [],
      "full_transcript": "Congress is a rich man's club. That's the problem. That's what we're trying to fix. I would suspect that I probably have the fewest assets of anybody sitting on this dias. I am not a rich man, unlike those to my left. So, I mean, listen, the American people look at people like the former speaker of the house, who makes better returns than anybody in America. They look at senators who were investigated during the COVID pandemic for their miraculous stock trades, and they say, how is this possible? To think that this might become a problem in the future is, frankly, fanciful. It's a problem now. It is. And it's not just in perception. It is reality. Members of Congress are trading daily based on information that the public doesn't have. And now we've heard the insider trading. I understand that insider trading is banned, but let's be honest. Members of Congress get information that is technically not insider information. Is defined by the securities laws, that is nevertheless extremely beneficial to know. And often we get it earlier than other people.",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": false,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": false,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 4
    },
    {
      "rank": 24,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7114656750862748974",
      "likes": 649700,
      "plays": 4500000,
      "shares": 4039,
      "comments": 5373,
      "engagement_rate": 0.14646933333333334,
      "duration": 56,
      "description": "#greenscreen #stitch with @itdontbelikethat whats the coolest place you’ve traveled to? #money #finance #young #millennial #genz #travel #vacation #flight #jetsetter #hotel #resort #holiday #europe",
      "hashtags": [
        "greenscreen",
        "stitch",
        "",
        "money",
        "finance",
        "young",
        "millennial",
        "genz",
        "travel",
        "vacation",
        "flight",
        "jetsetter",
        "hotel",
        "resort",
        "holiday",
        "europe"
      ],
      "full_transcript": "okay so hear me out yes I agree you should have fun experiences in your life while you're young but it's not as easy as just making the money back and this is because most people don't understand the concept of time value of money you do though because you follow me I'm Vivian your rich bff and your favorite Wall Street girl who's gonna break it down  that flight & vacation at 25 may have only cost you $3000 but if you needed to make that money back at 35 - 10 years later you'd actually have to make $7,781.23 if you didn't make that money back until 45 you’d need to make over 20 gs to equal that $3000 from your earlier years money has time value because it has earning potential if you're able to invest your money earlier on you won't have to work as hard in the future.  this is all to say if you can invest while having fun when you're younger you'll have fun today and in the future!",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 5
    },
    {
      "rank": 25,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7060862680017538350",
      "likes": 408300,
      "plays": 2800000,
      "shares": 933,
      "comments": 790,
      "engagement_rate": 0.14643678571428573,
      "duration": 34,
      "description": "@iamcardib knows what she’s worth & DEMANDS it. Thats why she gets PAID. #money #cardib #rapper #celebrity #rich #luxury #wealthy #girls #women",
      "hashtags": [
        "",
        "money",
        "cardib",
        "rapper",
        "celebrity",
        "rich",
        "luxury",
        "wealthy",
        "girls",
        "women"
      ],
      "full_transcript": "maybe two hundred years before men and women get paid equally i get paid equally wanna know why as i came up and everything i used to see some male rappers right shows together and i used to ask bro why this man making more money than me when i'm the one that bringing out all the this but these artists were still getting paid more than me so you know what i said i'm gonna stop taking bookings until you start paying me more and that bag double the fuck up",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": false,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 3
    },
    {
      "rank": 26,
      "author": "nastyaswan",
      "url": "https://www.tiktok.com/@nastyaswan/video/7496139311608384798",
      "likes": 120000,
      "plays": 938000,
      "shares": 15900,
      "comments": 744,
      "engagement_rate": 0.14567590618336887,
      "duration": 6,
      "description": "",
      "hashtags": [],
      "full_transcript": "Men are so weird. They're like, how could somebody hurt you like this? This is so awful. I'm gonna hurt you like this.",
      "content_patterns": {
        "personal_story": false,
        "statistics_mentioned": false,
        "call_to_action": false,
        "urgency_language": false,
        "social_proof": false,
        "question_hook": true,
        "polarizing_statement": false,
        "relatable_scenario": false,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 1
    },
    {
      "rank": 27,
      "author": "_itsornella",
      "url": "https://www.tiktok.com/@_itsornella/video/7558455167872437559",
      "likes": 266,
      "plays": 2032,
      "shares": 14,
      "comments": 11,
      "engagement_rate": 0.14320866141732283,
      "duration": 172,
      "description": "What are some of investment platforms you've used and loved? I've used a few investment platforms to date and my favs are @bettermenthq and @robinhoodapp because of how easy they make investing for beginners! Being able to auto invest with Betterment has particularly allowed me to grow my investments because the platform is doing all of the work for me.\n\n#investingforbeginners #investingexplained #investingtips #financialfreedom #moneytok #wealthbuilding #moneymanagement",
      "hashtags": [
        "",
        "",
        "investingforbeginners",
        "investingexplained",
        "investingtips",
        "financialfreedom",
        "moneytok",
        "wealthbuilding",
        "moneymanagement"
      ],
      "full_transcript": "I'm gonna rate all of the investment platforms that I've used to date as a girly who is investing to become a millionaire by 45. Number one, Charles Schwab. I would give this a three and a half out of five. This is a really good place if you are someone who wants to build your own portfolios. You kind of know what you're doing investment wise, and you want to be able to purchase stocks and do all of that in one place. Charles Schwab is a great brokerage account to do so. They give you a lot of autonomy to build your own portfolios. But for some people who have no idea what they're doing, this can actually be a little overwhelming. Um, and that's actually why I ended up moving my money from them. Not because I couldn't manage my own money, but because I didn't want to. And I didn't want to go in and have to purchase my own investments on a monthly basis. Number two, betterment. This is a 5 out of five for me. This is where all of my investments are now. I have my I R A. With them. I have my sub I R A. With them. I have my general brokerage accounts with them. It is just so easy to use betterment as an investment vehicle. I love the fact that it is automated for you, but you still have some customization in terms Of the blend of your portfolio and how you ultimately structure it. But I love the fact that they will do all of the investing for you. I just need to set a certain amount each month. Out of sight, out of mind. Love that there are other robo advisors that do this as well. Wellfleet is one of them. So you can use either of these interchangeably. But betterment has been my investment platform of choice. I was one of the early adopters of Robinhood. I was on that platform since 2016 2017, and I was getting all my friends, whoever would listen to me, I was telling them to invest on Robinhood. I like how Robinhood is a very gamified way of investing. They give you a lot of information on their platform that helps. Um, I deduct a point because, again, similar to Charles Schwab, you really are out in the open, investing on your own. And for some people who don't know what they're doing, that can be overwhelming. Also, this could be good or bad, depending on how you view it and what your investment strategies are. But they very easily allow you to, uh, participate in options trading, margin trading, all of those things. And for people who are not familiar with investing and don't really know what they're doing, this can be dangerous. So the gamified aspect of it makes that kind of Investment easier for people who understand what they're doing. But if you do not, it can become a very slippery slope, and it can trend very closely towards gambling. You do Vanguard Fidelity interchangeably? Because I've had them for, like, work for one K's and that kind of stuff. I don't really like their user interface. So three and a half out of five. They give you the same thing as Charles Schwab, kind of, but I think their user interfaces are a little dated. We're having all of my work for Owen K's and all of that, it was a little clunky. So I would give Vanguard and Fidelity three and a half out of five. What investment platforms do you use and love and, you know, feel like you wanna share with the group?",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": false,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": true
      },
      "pattern_count": 6
    },
    {
      "rank": 28,
      "author": "quiverquant",
      "url": "https://www.tiktok.com/@quiverquant/video/7132929069246778670",
      "likes": 180900,
      "plays": 1300000,
      "shares": 3509,
      "comments": 1148,
      "engagement_rate": 0.14273615384615385,
      "duration": 90,
      "description": "MONEY TALKS 🗣 #quiverquant #lobbying #stocks #government #fda #fyp",
      "hashtags": [
        "quiverquant",
        "lobbying",
        "stocks",
        "government",
        "fda",
        "fyp"
      ],
      "full_transcript": "how on earth would big tobacco profit off of the loss of this young man now I hate to think in such callous terms but if anything we'd be losing a customer it's not only our hopes in our best interest to keep robin alive and smoking the ron goodies of this world want the robin willagers to die you know why so that their budgets will go up this is nothing less than trafficking in human misery and you sir ought to be ashamed of yourself I ought to be ashamed that's a scene from the movie thank you for smoking depicting lobbying for big tobacco but here's an unpopular opinion all lobbying isn't bad let me explain last month irago a company that makes hearing aids spend 50 000 in lobbying you see up until now if you were one of the 29 million americans who could benefit from hearing aids you would need to see a doctor and get a prescription for it and then pick up an fda approved hearing aid but irigo argued that this law was unnecessary and that anyone should be able to get a hearing aid over the counter and to everyone surprised the fda actually listens and changed the rules so that now you no longer need a prescription and here's the crazy part yurgo was up over 200 % in the last month because of this new ruling because of stuff like this happening all the time it got me thinking what if I bought the stocks that reported the most growth in lobbying spending over the last quarter so I went ahead and made an algo that does exactly that and if you invested only using this data starting back in 2009 with 100 000 it would be 19 $1000000 to death I made the lobbying data public on my website so if you want to see it for yourself just search quiverquant and click on corporate lobby and as always until next time",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": true,
        "call_to_action": false,
        "urgency_language": true,
        "social_proof": true,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": true,
        "emotional_appeal": true,
        "contrarian_view": true
      },
      "pattern_count": 8
    },
    {
      "rank": 29,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7215219181380177198",
      "likes": 358000,
      "plays": 2600000,
      "shares": 11200,
      "comments": 1147,
      "engagement_rate": 0.14244115384615386,
      "duration": 56,
      "description": "How to ACTUALLY get rich. #money #finance #savingmoney #investing #learning #wealth #rich #personalfinance #financialliteracy #lifehack #college #student #school #university #studentloans #18 #21 #19 #22  #teen #20s ",
      "hashtags": [
        "money",
        "finance",
        "savingmoney",
        "investing",
        "learning",
        "wealth",
        "rich",
        "personalfinance",
        "financialliteracy",
        "lifehack",
        "college",
        "student",
        "school",
        "university",
        "studentloans",
        "18",
        "21",
        "19",
        "22",
        "teen",
        "20s"
      ],
      "full_transcript": "your money is better spent on experiences and memories but you're better than me than stuff you'll throw away and you wanna be the first rich and I mean really rich person in your family step 2 this is where screwed myself I wanted to fit in and I know you're rolling your eyes but just stick with me here if you started at 18 and stayed on this path I didn't start doing this till 23 you have to do these 3 things right now  like this fur vest you'd retire with over 3 million dollars in particular if you wanna set it and forget it funnel as much of it as possible into investments instead you're gonna start investing it doesn't matter you'd be able to retire earlier with more money if you're 18 to 22 college-ish age Who’s gonna teach you how to be good with money best part if you invested more as your career grew the goal is to have extra money coming in contribute up to $541 a month and buy a 2070 target date retirement fund open up a Roth IRA the money that you make that you don't need for necessities one earn income Mow some lawns, babysit, tutor I'm Vivian your rich BFF and your favorite Wall Street girly so I spent a bunch of money I earned on stuff I didn't need",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": true,
        "call_to_action": false,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": true,
        "emotional_appeal": false,
        "contrarian_view": true
      },
      "pattern_count": 6
    },
    {
      "rank": 30,
      "author": "yourrichbff",
      "url": "https://www.tiktok.com/@yourrichbff/video/7145095547047742762",
      "likes": 347000,
      "plays": 2500000,
      "shares": 5102,
      "comments": 926,
      "engagement_rate": 0.1412112,
      "duration": 58,
      "description": "Have you ever referred a friend to a job?? #money #work #career #job #office #pay #interview #resume #corporate #bff #friend #networking #tech #business #greenscreen ",
      "hashtags": [
        "money",
        "work",
        "career",
        "job",
        "office",
        "pay",
        "interview",
        "resume",
        "corporate",
        "bff",
        "friend",
        "networking",
        "tech",
        "business",
        "greenscreen"
      ],
      "full_transcript": "one of my smartest friends just tried to cold apply for a job at google and I all but smacked the laptop out of his hands to prevent him from making this huge mistake you'd never do that though because you follow me vivian your rich bff and your favorite wall street girly who's gonna let you in on this career secret never apply for a job blindly always seek a referral from someone at the company before you submit an application. And I know you're thinking - I don't know anybody who works there you don't need to before you submit a job application go to LinkedIn and search the company you wanna work at  once you're there you're gonna go to the people tab it'll then show your friends people from your school people in your area and second and third degree connections that work at that company then you just dm them and ask them to refer you why would anyone do that for you?!  to get paid duh at most companies when an employee refers someone who ends up getting hired they'll get a bonus and if the referral doesn't get hired there aren't any consequences for that employee so reach out having a referral will significantly increase your chances of getting that first interview which is usually the hardest step!!",
      "content_patterns": {
        "personal_story": true,
        "statistics_mentioned": false,
        "call_to_action": true,
        "urgency_language": true,
        "social_proof": false,
        "question_hook": false,
        "polarizing_statement": true,
        "relatable_scenario": false,
        "emotional_appeal": false,
        "contrarian_view": false
      },
      "pattern_count": 4
    }
  ]
}